<html>
<head>
<title>Prof.Dr. E. L&oacute;pez: Escultura matem&aacute;tica</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body bgcolor="#D9F4DB" text="#000000" background="fondo.GIF">
<p align="center">&nbsp;</p>
<p align="center"><font size="4"><b>DISE&Ntilde;O Y MANUFACTURA DE OBJETOS EST&Eacute;TICOS<br>
  UTILIZANDO LA METODOLOG&Iacute;A DE PUNTA DEL DISE&Ntilde;O GEOM&Eacute;TRICO</b></font></p>
<p align="center"><a href="mailto:Prof.Dr.Elopez@gmail.com">Fco. Eugenio L&oacute;pez 
  Guerrero</a></p>
<p align="center"><font face="Arial, Helvetica, sans-serif">Cuerpo Acad&eacute;mico 
  Sistemas Integrados de Manufactura<br>
  Facultad de Ingenier&iacute;a Mec&aacute;nica y El&eacute;ctrica, Universidad 
  Aut&oacute;noma de Nuevo Le&oacute;n.<br>
  Av. Universidad S/N, Apdo. Postal 9-&quot;F&quot;, CP. 66451, San Nicol&aacute;s 
  de los Garza, N.L., M&eacute;xico.<br>
  Tel&eacute;fono: (0052-81) 8329-4020. Fax: (0052-81) 8332-0904<br>
  </font> </p>
<table width="31%" border="1" align="center">
  <tr> 
    <td width="50%">
      <div align="center"><a href="wire.png"><img src="wire.gif" width="300" height="222" border="5"></a></div>
    </td>
    <td width="50%"> 
      <div align="center"><a href="Beta-001.png"><img src="Beta-001.gif" border="5"></a></div>
    </td>
  </tr>
  <tr> 
    <td height="36" colspan="2"> 
      <p align="center">&quot;Generated by 'Sculpture Generator 1' by Carlo H. 
        S&eacute;quin, UC Berkeley&quot; <a href="../../@3D/sequin/Beta-001.zip">(Archivo 
        STL)</a> </p>
    </td>
  </tr>
</table>
<p align="center">&nbsp;</p>
<p align="left"><font face="Arial, Helvetica, sans-serif"><b>RESUMEN</b><br>
  El dise&ntilde;o de geometr&iacute;as ornamentales utilizando formas generadas 
  matem&aacute;ticamente ha estado presente desde el momento en que la intenci&oacute;n 
  de la obra de arte se abstrajo en la forma dejando de lado su funci&oacute;n. 
  Hoy en d&iacute;a existe una generaci&oacute;n de artistas que intentan sacar 
  el mayor provecho de las metodolog&iacute;as y las herramientas tecnol&oacute;gicas 
  de punta para crear su arte.</font></p>
<p><font face="Arial, Helvetica, sans-serif">Este trabajo no entra al debate sobre 
  las cualidades art&iacute;sticas de los objetos, m&eacute;todos y procesos, 
  pero como contribuci&oacute;n ofrece un panorama claro de aplicaci&oacute;n 
  de nuevas herramientas de creaci&oacute;n. Por medio de ellas es posible encontrar 
  relaciones que permitan obtener objetos que por otros medios ser&iacute;an hasta 
  hoy imposibles de construir. El presente incluye solamente la soluci&oacute;n 
  al problema geom&eacute;trico, por medio de la mezcla de diferentes procesos 
  que incluyen la captura, edici&oacute;n y fabricaci&oacute;n de modelos geom&eacute;tricos. 
  Se muestra un m&eacute;todo que incluye los procedimientos de dise&ntilde;o 
  geom&eacute;trico por computadora, procesamiento de fotorrealismo y fabricaci&oacute;n 
  en prototipos r&aacute;pidos y a gran escala.</font></p>
<p><font face="Arial, Helvetica, sans-serif"><b><i>Palabras clave:</i></b> ingenier&iacute;a 
  inversa, digitalizaci&oacute;n 3D, dise&ntilde;o geometrico, prototipos r&aacute;pidos.<br>
  </font></p>
<p align="center">&nbsp;</p>
<p align="left"><b><font face="Arial, Helvetica, sans-serif">INTRODUCCI&Oacute;N</font></b><font face="Arial, Helvetica, sans-serif"><br>
  El dise&ntilde;o geom&eacute;trico por computadora (CAGD por sus siglas en ingl&eacute;s) 
  se ha desarrollado a partir de la necesidad de modelar curvas y superficies 
  &quot;complejas&quot;, tambi&eacute;n llamadas de &quot;forma libre&quot; o 
  &quot;biol&oacute;gicas&quot;. Estas se refieren a aquellas entidades que intentan 
  reproducir aquellas geometr&iacute;as que no son producto de una ecuaci&oacute;n 
  primitiva (como por ejemplo las c&oacute;nicas).<br>
  El arte, la ciencia y la tecnolog&iacute;a han evolucionado juntos. Hist&oacute;ricamente 
  los avances en cualquiera de estas &aacute;reas influyen directamente en la 
  transformaci&oacute;n de las otras dos. Esta condici&oacute;n del pensamiento 
  tiene m&uacute;ltiples ejemplos a lo largo de la historia, donde personajes 
  que han sido estudiosos de la ingenier&iacute;a, matem&aacute;ticas, arquitectura 
  y dise&ntilde;o han dado destacadas muestras de manifestaciones art&iacute;sticas. 
  Esta multidisciplinaridad, se observa en el mundo del arte contempor&aacute;neo, 
  abri&eacute;ndose las posibilidades en nuevas pr&aacute;cticas del quehacer 
  art&iacute;stico.<br>
  En la actualidad la tecnolog&iacute;a, el arte y la ciencia est&aacute;n estrechamente 
  ligados a la vida diaria por lo tanto la creaci&oacute;n art&iacute;stica no 
  escapa de su influencia como fen&oacute;meno cultural, por el contrario es deseable 
  que las tres &aacute;reas encuentren en su evoluci&oacute;n la capacidad de 
  integrar su aportaciones en una armoniosa vinculaci&oacute;n.<br>
  Hay escasa publicaci&oacute;n de estudios sobre el uso de tecnolog&iacute;a 
  en el arte desde una aproximaci&oacute;n equilibrada. Los trabajos adolecen 
  de ser estrictamente t&eacute;cnicos o bien rigurosamente art&iacute;sticos. 
  En algunos casos se concretan a enlistar y analizar la obra de artistas caracter&iacute;sticos 
  de escultura abstracta en donde las relaciones entre la tecnolog&iacute;a y 
  el arte son solo inferidas. </font></p>
<p><font face="Arial, Helvetica, sans-serif">Este trabajo parte de la base que 
  no hay registro en M&eacute;xico de artistas que produzcan como aqu&iacute; 
  se plantea. Al ser m&eacute;todos con tecnolog&iacute;a de punta, existen en 
  el pa&iacute;s solamente algunos lugares dotados con este equipo, por lo que 
  donde hay se usa en el ambiente de producci&oacute;n y negocios. Sin embargo, 
  se demuestra en este estudio que hay una demanda significativa de elementos 
  est&eacute;ticos que solo pueden ser elaborados a trav&eacute;s de herramientas 
  tecnol&oacute;gicas avanzadas, especialmente en la arquitectura y en la escultura. 
  Como los trabajos del arquitecto Frank O Gehry desarrollados con software CATIA 
  que originalmente fue dise&ntilde;ado para elaborar componentes relacionados 
  con la aeron&aacute;utica.<br>
  </font></p>
<p align="left"><font face="Arial, Helvetica, sans-serif"><b>OBJETIVOS</b><br>
  El objetivo general de este trabajo fue XXX por medio de diferentes metodolog&iacute;as 
  para capturar, editar e imprimir en prototipos r&aacute;pidos. Esta tecnolog&iacute;a 
  tiene la ventaja de ser un proceso r&aacute;pido y con buen nivel de precisi&oacute;n. 
  Adicionalmente presenta la ventaja de que una vez capturada la geometr&iacute;a, 
  es posible fabricar r&eacute;plicas de diferentes tama&ntilde;os y materiales.</font></p>
<p><font face="Arial, Helvetica, sans-serif">Los objetivos particulares fueron: 
  <br>
  </font></p>
<ul>
  <li><font face="Arial, Helvetica, sans-serif">Detallar todas las fases de procesamiento.</font></li>
  <li><font face="Arial, Helvetica, sans-serif">Convertir la informaci&oacute;n 
    geom&eacute;trica en formato para imprimir en prototipos r&aacute;pidos.</font></li>
  <li><font face="Arial, Helvetica, sans-serif">Mostrar un panorama del estado 
    del arte en otras sociedades y su potencial factibilidad en M&eacute;xico.</font></li>
</ul>
<p><font face="Arial, Helvetica, sans-serif">Este trabajo se centra en la reconstrucci&oacute;n 
  geom&eacute;trica. Parte de la premisa que la obra de arte establece un ejercicio 
  de contemplaci&oacute;n, sujeto al objeto por cuanto sea visto como realidad 
  contemplada. </font></p>
<p><font face="Arial, Helvetica, sans-serif"><br>
  </font> </p>
<table width="34%" border="1" align="center">
  <tr> 
    <td width="34%" height="311"> 
      <div align="center"><img src="CAPAS_PROGRESO_V2.gif" width="189" height="302" border="5"></div>
    </td>
    <td width="66%" height="311"> 
      <div align="center"><img src="IMAG0090.JPG" width="399" height="300" border="5"></div>
    </td>
  </tr>
  <tr> 
    <td colspan="2">
      <div align="center">Impresi&oacute;n en prototipo r&aacute;pido. (a) Capas 
        de impresi&oacute;n y (b) pieza producida en la m&aacute;quina ZCorp.</div>
    </td>
  </tr>
</table>
<p align="left">&nbsp;</p>
<p align="left"><font face="Arial, Helvetica, sans-serif"><b>ARTE Y T&Eacute;CNICA</b></font></p>
<p align="left"><font face="Arial, Helvetica, sans-serif">En Marzo del 2005, con 
  estudiantes de la Stony Brook, elaboraron este modelo matem&aacute;tico que 
  es exhibido en el vest&iacute;bulo del Centro de Estudiantes de la Stony Brook.</font></p>
<ul>
  <li><font face="Arial, Helvetica, sans-serif">Ergun Akleman, Profesor Doctor 
    de Ciencias Visuales del departamento de Arquitectura de la Texas A&amp;M 
    University. Es Doctor en Filosof&iacute;a enfocado en Gr&aacute;fica Realizada 
    por Computadora por el Departamento El&eacute;ctrico y de Ingenier&iacute;a 
    de Computacional en el Instituto de Tecnolog&iacute;a de Georgia. Predominantemente 
    da clases de maestr&iacute;a en Ciencias Visuales en la escuela de Arquitectura 
    de la A&amp;M University.</font></li>
  <li><font face="Arial, Helvetica, sans-serif">Professor Carlo Sequin , CS Division, 
    EECS Dept., U.C. Berkeley.- El trabajo de S&eacute;quin en la gr&aacute;fica 
    realizada por ordenador y en el dise&ntilde;o geom&eacute;trico tambi&eacute;n 
    ha proporcionado un puente al mundo de arte. En la colaboraci&oacute;n con 
    unos escultores del arte geom&eacute;trica abstracta, en particular con Brent 
    Collins, S&eacute;quin ha encontrado un nuevo inter&eacute;s y a&uacute;n 
    otra esfera donde el uso de instrumentos automatizados puede ser explorado 
    y donde las nuevas fronteras pueden ser abiertas por el uso de tales instrumentos.<br>
    </font></li>
</ul>
<p align="left">&nbsp;</p>
<p align="center">&nbsp;</p>
<p align="left"><font face="Arial, Helvetica, sans-serif"><b>EL PROCESO COMPLETO 
  DE CONSTRUCCI&Oacute;N</b></font><font face="Arial, Helvetica, sans-serif">.</font></p>
<p align="left">1) TRATAMIENTO Y ACONDICIONAMIENTO DE GEOMETRIA EN RHINOCEROS 
</p>
<p align="left"><font face="Arial, Helvetica, sans-serif">La metodolog&iacute;a 
  no ayuda al dise&ntilde;o de esculturas ni acelera el proceso creativo que lleva 
  a la misma. A continuaci&oacute;n se describir&aacute; detalladamente el proceso 
  que se llevo a cabo para la creaci&oacute;n de la escultura. Se inicia el proceso 
  importando la geometr&iacute;a a rhinoceros mediante el comando <i><b><font color="#FF0000">open</font></b></i>. 
  Se debe de tener cuidado de escoger el tipo de archivo con el cual se desea 
  importar la geometr&iacute;a (en este caso se uso esterolitografia <i><font color="#990000"><b><font color="#FF0000">STL</font></b></font></i>) 
  que aparece en la pesta&ntilde;a inferior al nombre.</font></p>
<table width="31%" border="5" align="center">
  <tr>
    <td>
      <div align="center"><img src="reporte%20-%20open.gif" width="581" height="317"></div>
    </td>
  </tr>
  <tr>
    <td>Figura 2. Ventana para abrir un archivo en rhinoceros 4.0</td>
  </tr>
</table>
<p align="left"><font face="Arial, Helvetica, sans-serif">La dimensi&oacute;n 
  de la geometr&iacute;a inicialmente es 7.746 x 8.683 x 5.547 mm. La dimensi&oacute;n 
  m&iacute;nima de la escultura son 30 cm, se necesita hacer la figura 34.5 veces 
  m&aacute;s grande. Se escala mediante el bot&oacute;n <i><font color="#FFFFCC"><b><font color="#FF0000">scale 
  <img src="icon%20-%20scale.gif" width="36" height="38"> </font></b></font></i> 
  en la barra de comandos a la izquierda , se selecciona la geometr&iacute;a y 
  se da enter. Se pide un punto para escalar por lo que usaremos el 0, 0,0 (el 
  centro desde la vista de arriba), luego nos pedir&aacute; una escala para el 
  objeto, esta la obtenemos dividendo el &aacute;rea de trabajo (30 cm) entre 
  la dimensi&oacute;nm&aacute;s grande de la geometr&iacute;a (8.683mm), y damos 
  enter.<br>
  Para trabajar en el plano XY es necesario rotar la figura. Para lograrlo se 
  debe hace clic en el bot&oacute;n &quot;Rotate3D&quot;, posteriormente se selecciona 
  la figura y se presiona la tecla enter. El programa pedir&aacute; un eje X, 
  luego una segunda l&iacute;nea que ser&aacute; el eje Y(o paralela). Finalmente 
  el segundo punto de referencia en el cual tecleamos 90 figura 4.</font></p>
<p>&nbsp;</p>
<table width="31%" border="5" align="center" height="338">
  <tr> 
    <td> 
      <div align="center"><img src="reporte%20i-%20mported.gif" width="597" height="299"></div>
    </td>
  </tr>
  <tr> 
    <td height="35">Figura 3. Modelo escalado y rotado. Medidas: largo=27.883cm 
      ancho=30cm alto=21.684cm</td>
  </tr>
</table>
<p align="left"><font face="Arial, Helvetica, sans-serif">El siguiente paso es 
  dividir la geometr&iacute;a en capas de 3.2 mil&iacute;metros, esto se debe 
  a que el material con el que trabajaremos ser&aacute; trovicel con un espesor 
  de 3 mil&iacute;metros e imprimiremos cada capa individualmente en papel bond 
  con espesor de .09 mil&iacute;metros, cada capa ser&aacute; unida entre s&iacute; 
  con pegamento. Al sumar los espesores del trovicel, el papel bond y el pegamento 
  nos da un espesor total promedio de 3.2 mil&iacute;metros figura 5.<br>
  Para realizar el seccionamiento de las partes se da clic en <b><i><font color="#FF0000">contour 
  </font></i></b> <img src="icon%20-%20contour.gif" width="38" height="41"> y 
  seleccionar la geometr&iacute;a; despu&eacute;s se dibuja una l&iacute;nea en 
  el eje Z para la cual se crearan planos ortogonales para dibujar los contornos. 
  Despu&eacute;s debemos de ingresar la distancia que habr&aacute; entre capas 
  (3.2 mm).</font></p>
<table width="31%" border="5" align="center" height="338">
  <tr> 
    <td> 
      <div align="center"><img src="reporte%20-%20split.gif" width="628" height="315"></div>
    </td>
  </tr>
  <tr> 
    <td height="35">Figura 4. Divisi&oacute;n de la geometr&iacute;a en 42 capas.</td>
  </tr>
</table>
<p align="left"><font face="Arial, Helvetica, sans-serif">Con las capas hechas 
  procedemos a eliminar todas las capas menos la primera y guardar el archivo 
  como &quot;capa1&quot;, deshacemos el eliminar y borramos ahora todas las capas 
  menos la segunda y grabamos como &quot;capa2&quot;; as&iacute; hasta tener todas 
  las capas grabadas en un archivo para cada una.</font></p>
<p><font face="Arial, Helvetica, sans-serif">Analizando las capas una por una 
  escogemos puntos de uni&oacute;n en la geometr&iacute;a, los puntos deben de 
  tener un &aacute;rea efectiva de unos 9mm2en m&iacute;nimo en 2 capas anteriores 
  para facilitar el posicionamiento de la pieza.Estos se posicionan mediante el 
  bot&oacute;n <b><i><font color="#FF0000">point</font></i></b> <img src="icon%20-%20point.gif" width="28" height="27"> 
  y un clic en la geometr&iacute;a (es conveniente escoger puntos de referencia 
  que tengan material una capa antes).<br>
  </font></p>
<table width="24%" border="5" align="center" height="338">
  <tr> 
    <td> 
      <div align="center"><img src="reporte%20-%20contornos.gif" width="440" height="498"></div>
    </td>
  </tr>
  <tr> 
    <td height="35">Figura 5. Puntos de referencia de la capa 21.</td>
  </tr>
</table>
<p align="left"><font face="Arial, Helvetica, sans-serif"><br>
  Ya teniendo las capas se procede a imprimir las capas en hoja tama&ntilde;o 
  oficio. Para ello solo se da clic en men&uacute; archivo, imprimir, seleccionamos 
  el &aacute;rea de impresi&oacute;n y la escala 1:1 de impresi&oacute;n. Al imprimir 
  debemos de cuidar que toda la geometr&iacute;a este dentro de la hoja (de no 
  ser as&iacute; el &aacute;rea de impresi&oacute;n se puede mover en la pesta&ntilde;a 
  de escala con el bot&oacute;n mover). </font></p>
<p align="left">DESCRIPCION DEL PROCEDIMIENTO DE MANUFACTURA DE LA ESCULTURA</p>
<p><font face="Arial, Helvetica, sans-serif">1.- Puntos de uni&oacute;n</font></p>
<p><font face="Arial, Helvetica, sans-serif">Siguiendo con el proceso de fabricaci&oacute;n 
  de la escultura, las 41 capas de la figura han sido almacenadas en 41 archivos 
  de RINO (.3dm), la cuales fueron nombradas y numeradas en orden ascendente.</font></p>
<p><font face="Arial, Helvetica, sans-serif">La impresi&oacute;n de las capas 
  fue la siguiente fase del proceso. Es importante mencionar nuevamente que cada 
  una de las capas cuenta con puntos de uni&oacute;n y puntos de uni&oacute;n 
  posterior. Los puntos de uni&oacute;n son aquellas marcas que se perforan para 
  unir la pieza A a la pieza B. Los puntos de uni&oacute;n posterior son aquellos 
  que tienen la funci&oacute;n de establecer la referencia que la siguiente pieza 
  (C) necesitara.<br>
  </font> </p>
<p>&nbsp; </p>
<table width="33%" border="5" align="center" height="338">
  <tr> 
    <td height="222"> 
      <div align="center"><img src="reporte%20-%20puntos%20union.gif" width="630" height="278"></div>
    </td>
  </tr>
  <tr> 
    <td height="35">Figura 6.- Tres capas consecutivas (A, B, C), marcadas donde 
      se ha se&ntilde;alado los puntos de uni&oacute;n de color rojo y los puntos 
      de uni&oacute;n posterior (coordenadas de todos los puntos se encuentran 
      almacenados para su consulta al momento de ensamblarlos).</td>
  </tr>
</table>
<p align="left"><font face="Arial, Helvetica, sans-serif">2.- Estampado</font></p>
<p><font face="Arial, Helvetica, sans-serif">Al tener las capas impresas en papel 
  se procede a pegarlas sobre la superficie del material que se utilizo para darle 
  volumen a la figura, en este caso se monto sobre placas de trovicel. El pegamento 
  utilizado fue l&aacute;piz adhesivo como lo muestra la siguiente imagen.<br>
  </font></p>
<p align="center">&nbsp;</p>
<table width="36%" border="5" align="center">
  <tr> 
    <td width="41%"> 
      <div align="center"><img src="reporte%20-%20montaje1.gif" width="329" height="248"></div>
    </td>
    <td width="59%"> 
      <div align="center"><img src="reporte%20-%20montaje2.gif" width="329" height="246"></div>
    </td>
  </tr>
  <tr> 
    <td colspan="2">Figura 7. a) Montaje de la hoja de papel sobre la superficie 
      del trovicel; b) acabado final.</td>
  </tr>
</table>
<p align="left"><font face="Arial, Helvetica, sans-serif">3.- Corte</font></p>
<p><font face="Arial, Helvetica, sans-serif">Una de las etapas m&aacute;s complicadas 
  del proceso fue cuando se removi&oacute; el material excedente de la capa. Este 
  proceso lo hemos dividido en 3 secciones.</font></p>
<p><font face="Arial, Helvetica, sans-serif">Secci&oacute;n 1</font></p>
<p><font face="Arial, Helvetica, sans-serif">En esta secci&oacute;n se extrae 
  la pieza completa de la placa entera de trovicel. Se realiza un corte no detallado 
  tomando una distancia considerable al borde de la pieza final como lo muestran 
  las siguientes im&aacute;genes. </font><font face="Arial, Helvetica, sans-serif">El 
  primer corte es el m&aacute;s sencillo debido a que se toma una tolerancia muy 
  grande con respecto a la distancia de corte al borde de la capa, la finalidad 
  es extraer de las placas de trovicel ya que es la pieza que nos interesa para 
  poder proceder a eliminar los excedentes de material no deseado. </font></p>
<p><font face="Arial, Helvetica, sans-serif">A continuaci&oacute;n se muestra 
  una imagen que muestra la manera en la que las capas se extraen de las placas 
  de trovicel.<br>
  </font></p>
<p align="left">&nbsp; </p>
<p align="left">&nbsp;</p>
<hr size="20">
<p align="left">&nbsp;</p>
<table width="67%" border="1" align="center">
  <tr> 
    <td width="22%"><a href="construccion01.JPG"><img src="construccion01.gif" width="300" height="225" border="0"></a></td>
    <td width="22%"><a href="construccion02.JPG"><img src="construccion02.gif" width="300" height="225" border="5"></a></td>
    <td width="23%"><a href="construccion03.JPG"><img src="construccion03.gif" width="300" height="225" border="5"></a></td>
    <td width="33%"><a href="construccion04.JPG"><img src="construccion04.gif" width="300" height="225" border="5"></a></td>
  </tr>
  <tr> 
    <td width="22%"> 
      <div align="center"></div>
    </td>
    <td width="22%"> 
      <div align="center"></div>
    </td>
    <td width="23%"> 
      <div align="center"></div>
    </td>
    <td width="33%"> 
      <div align="center"></div>
    </td>
  </tr>
  <tr> 
    <td width="22%"><a href="construccion05.JPG"><img src="construccion05.gif" width="300" height="225" border="5"></a></td>
    <td width="22%"><a href="construccion06.JPG"><img src="construccion06.gif" width="300" height="225" border="5"></a></td>
    <td width="23%"><a href="construccion07.JPG"><img src="construccion07.gif" width="300" height="225" border="5"></a></td>
    <td width="33%"><a href="construccion08.JPG"><img src="construccion08.gif" width="300" height="225" border="5"></a></td>
  </tr>
  <tr> 
    <td width="22%">&nbsp;</td>
    <td width="22%">&nbsp;</td>
    <td width="23%">&nbsp;</td>
    <td width="33%">&nbsp;</td>
  </tr>
  <tr> 
    <td width="22%"> 
      <div align="center"><a href="construccion09.JPG"><img src="construccion09.gif" width="300" height="225" border="5"></a></div>
    </td>
    <td width="22%"> 
      <div align="center"><a href="construccion10.JPG"><img src="construccion10.gif" width="300" height="225" border="5"></a></div>
    </td>
    <td width="23%"> 
      <div align="center"><a href="construccion11.JPG"><img src="construccion11.gif" width="300" height="225" border="5"></a></div>
    </td>
    <td width="33%"> 
      <div align="center"><a href="construccion12.JPG"><img src="construccion12.gif" width="300" height="225" border="5"></a></div>
    </td>
  </tr>
  <tr> 
    <td width="22%"> 
      <div align="center"></div>
    </td>
    <td width="22%"> 
      <div align="center"></div>
    </td>
    <td width="23%"> 
      <div align="center"></div>
    </td>
    <td width="33%"> 
      <div align="center"></div>
    </td>
  </tr>
</table>
<p align="left">&nbsp;</p>
<p align="left">&nbsp;</p>
<table width="67%" border="1" align="center">
  <tr> 
    <td width="22%"> 
      <div align="center"><a href="DSC03369a.png"><img src="DSC03369a.gif" width="300" height="201" border="5"></a></div>
    </td>
    <td width="22%"> 
      <div align="center"><a href="DSC03553.png"><img src="DSC03553.gif" width="300" height="201" border="5"></a></div>
    </td>
    <td width="23%"> 
      <div align="center"><a href="DSC03489.png"><img src="DSC03489.gif" width="300" height="201" border="5"></a></div>
    </td>
    <td width="33%"> 
      <div align="center"><a href="DSC03376.png"><img src="DSC03376.gif" width="300" height="201" border="5"></a></div>
    </td>
  </tr>
  <tr> 
    <td width="22%"> 
      <div align="center"><a href="DSC03481.png"><img src="DSC03481.gif" width="300" height="201" border="5"></a></div>
    </td>
    <td width="22%"> 
      <div align="center"><a href="DSC03415.png"><img src="DSC03415.gif" width="300" height="201" border="5"></a></div>
    </td>
    <td width="23%"> 
      <div align="center"><a href="DSC03590.png"><img src="DSC03590.gif" width="300" height="201" border="5"></a></div>
    </td>
    <td width="33%"> 
      <div align="center"><a href="DSC03510.png"><img src="DSC03510.gif" width="300" height="201" border="5"></a></div>
    </td>
  </tr>
  <tr> 
    <td colspan="4"> 
      <div align="center">Fotograf&iacute;as de la construcci&oacute;n de las 
        capas en trovicel y unidas con pegamento. Trabajo realizado por estudiantes 
        en mi <a href="../../@materias/265/265.htm">curso 
        de CAD/CAM</a></div>
    </td>
  </tr>
</table>
<p align="left">&nbsp;</p>
<table width="67%" border="1" align="center">
  <tr>
    <td width="22%">
      <div align="center"><a href="DSC04554.JPG"><img src="DSC04554.gif" width="300" height="201" border="0"></a></div></td>
    <td width="22%">
      <div align="center"><a href="DSC04522a.jpg"><img src="DSC04522a.gif" width="300" height="201" border="0"></a></div></td>
    <td width="23%">
      <div align="center"><a href="DSC04622.JPG"><img src="DSC04622.gif" width="300" height="201" border="0"></a></div></td>
    <td width="33%">
      <div align="center"><a href="DSC04559.JPG"><img src="DSC04559.gif" width="300" height="201" border="0"></a></div></td>
  </tr>
  <tr>
    <td width="22%">
      <div align="center"><a href="DSC04572.JPG"><img src="DSC04572.gif" width="300" height="201" border="0"></a></div></td>
    <td width="22%">
      <div align="center"><a href="DSC04641.JPG"><img src="DSC04641.gif" width="300" height="201" border="0"></a></div></td>
    <td width="23%">
      <div align="center"><a href="DSC04643.JPG"><img src="DSC04643.gif" width="300" height="201" border="0"></a></div></td>
    <td width="33%">
      <div align="center"><a href="DSC04581.JPG"><img src="DSC04581.gif" width="300" height="201" border="0"></a></div></td>
  </tr>
  <tr>
    <td colspan="4">
      <div align="center">Fotograf&iacute;as de la versi&oacute;n final . Trabajo realizado por estudiantes en mi <a href="../../@materias/265/265.htm">curso de CAD/CAM</a></div></td>
  </tr>
</table>
<p align="left">&nbsp;</p>
<p align="left">&nbsp;</p>
<table width="23%" border="5" align="center">
  <tr> 
    <td width="42%"> 
      <div align="center"><a href="DSC04014.JPG"><img src="DSC04014.gif" width="201" height="300" border="5"></a></div>
    </td>
    <td width="58%"> 
      <div align="center"><a href="DSC04026.JPG"><img src="DSC04026.gif" width="201" height="300" border="5"></a></div>
    </td>
  </tr>
  <tr> 
    <td width="42%">&nbsp;</td>
    <td width="58%">&nbsp;</td>
  </tr>
</table>
<p>&nbsp;</p><table width="34%" border="5" align="center">
  <tr>
    <td>
      <div align="center"><a href="DSC03956_pp%20final.jpg"><img src="DSC03956_pp%20final.gif" width="300" height="208" border="5"></a></div>
    </td>
    <td>
      <div align="center"><a href="DSC03997.JPG"><img src="DSC03997.gif" width="300" height="201" border="5"></a></div>
    </td>
  </tr>
  <tr>
    <td>&nbsp;</td>
    <td>&nbsp;</td>
  </tr>
</table>
<p align="left">&nbsp;</p>
<p align="left">&nbsp;</p>
<div align="center"> </div>
<p align="left">&nbsp;</p>
<hr>
<p align="center">&nbsp;</p>
<p align="center"><b><font size="5">MUESTRA DE ALGUNOS ARTISTAS CONTEMPORANEOS</font></b></p>
<p align="center">&nbsp;</p>
<p>&nbsp; </p>
<table width="65%" border="1" align="center">
  <tr> 
    <td width="22%" height="305"> 
      <div align="center"><img src="Cube5Volab).jpg" width="300" height="300"></div>
    </td>
    <td width="22%" height="305"> 
      <div align="center"><img src="Aurora_Borealis_Australis.jpg" width="300" height="300"></div>
    </td>
    <td width="21%" height="305"> 
      <div align="center"><img src="ScherkTower09.jpg" width="300" height="300"></div>
    </td>
    <td width="35%" height="305"><img src="DodecaVol09.jpg" width="300" height="300"></td>
  </tr>
  <tr> 
    <td colspan="4"> 
      <div align="center"><a href="http://www.cs.berkeley.edu/%7Esequin/">Carlo 
        H. S&eacute;quin </a></div>
    </td>
  </tr>
</table>
<p>&nbsp; </p>
<table width="65%" border="1" align="center">
  <tr> 
    <td width="22%" height="309"> 
      <div align="center"><img src="nexus_3q.jpg" width="300" height="300"></div>
    </td>
    <td width="22%" height="309"> 
      <div align="center"><img src="nexus_3hole.jpg" width="300" height="300"></div>
    </td>
    <td width="21%" height="309"> 
      <div align="center"><img src="borromean.jpg" width="300" height="300"></div>
    </td>
    <td width="35%" height="309"><img src="snow22.jpg" width="300" height="300"></td>
  </tr>
  <tr> 
    <td colspan="4"> 
      <div align="center"><a href="http://www.bathsheba.com/artist/">Bathsheba 
        Grossman</a> </div>
    </td>
  </tr>
</table>
<p>&nbsp; </p>
<table width="65%" border="1" align="center">
  <tr> 
    <td width="22%" height="309"> 
      <div align="center"><img src="sea000.jpg" width="300" height="300"></div>
    </td>
    <td width="22%" height="309"> 
      <div align="center"><img src="mx0302.jpg" width="300" height="300"></div>
    </td>
    <td width="21%" height="309"> 
      <div align="center"><img src="Kezio1.jpg" width="300" height="300"></div>
    </td>
    <td width="35%" height="309"><img src="Kezio-0081.jpg" width="300" height="300"></td>
  </tr>
  <tr> 
    <td colspan="4"> 
      <div align="center"><a href="http://www2.memenet.or.jp/%7Ekeizo/">Keizo 
        Ushio</a></div>
    </td>
  </tr>
</table>
<p>&nbsp; </p>
<table width="65%" border="1" align="center">
  <tr> 
    <td width="22%"> 
      <div align="center"><img src="Eine%20Kleine%20Link%20Musik.gif" width="300" height="246"></div>
    </td>
    <td width="22%"> 
      <div align="center"><img src="Umbilic%20Link%20II.gif" width="300" height="246"></div>
    </td>
    <td width="21%"> 
      <div align="center"><img src="Velocidad%20de%20Escape.gif" width="300" height="246"></div>
    </td>
    <td width="35%"><img src="Figureight%20Knot%20Complement.gif" width="300" height="246"></td>
  </tr>
  <tr> 
    <td colspan="4"> 
      <div align="center">Helaman Ferguson </div>
    </td>
  </tr>
</table>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp; </p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
</body>
</html>
